stubs/src/main/resources/wsdl/nfe/ms/prod/query_protocol.wsdl

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo4" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" name="NFeConsultaProtocolo4" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo4">
  <wsdl:types>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" elementFormDefault="qualified" targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo4" version="1.0">

  <xs:element name="nfeDadosMsg">
    <xs:complexType mixed="true">
      <xs:sequence>
        <xs:any namespace="##other" processContents="lax"/>
      </xs:sequence>
    </xs:complexType>
  </xs:element>

  <xs:element name="nfeResultMsg">
    <xs:complexType mixed="true">
      <xs:sequence>
        <xs:any namespace="##other" processContents="lax"/>
      </xs:sequence>
    </xs:complexType>
  </xs:element>

</xs:schema>
  </wsdl:types>
  <wsdl:message name="nfeConsultaNF">
    <wsdl:part element="tns:nfeDadosMsg" name="nfeDadosMsg">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="nfeConsultaNFResponse">
    <wsdl:part element="tns:nfeResultMsg" name="nfeConsultaNFResult">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="NFeConsultaProtocoloSoap">
    <wsdl:operation name="nfeConsultaNF">
      <wsdl:input message="tns:nfeConsultaNF" name="nfeConsultaNF">
    </wsdl:input>
      <wsdl:output message="tns:nfeConsultaNFResponse" name="nfeConsultaNFResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="NFeConsultaProtocolo4SoapBinding" type="tns:NFeConsultaProtocoloSoap">
    <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="nfeConsultaNF">
      <soap12:operation soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeConsultaProtocolo4/nfeConsultaNF" style="document"/>
      <wsdl:input name="nfeConsultaNF">
        <soap12:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="nfeConsultaNFResponse">
        <soap12:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="NFeConsultaProtocolo4">
    <wsdl:port binding="tns:NFeConsultaProtocolo4SoapBinding" name="nfeConsultaProtocolo4Soap12">
      <soap12:address location="https://nfe.sefaz.ms.gov.br/ws/NFeConsultaProtocolo4"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>